; ----------------------------------------------------------------------
        ivt     reset, _irqkbd
; ----------------------------------------------------------------------
_irqkbd:
brk
        irqenter
        keyboardirq()
        irqleave
        reti

; ----------------------------------------------------------------------
reset:  sti
        stop

; ----------------------------------------------------------------------
; Процедура-обработчик IRQ Keyboard AT&T сканкодов
; RETURN: ACC будет код клавиши и статус нажатия (старший байт)
; AFFECT: r0, flags
; ----------------------------------------------------------------------

keyboardirq:

        lda     [$FFA0]         ; PS2_KEYB_CODE
        clh
        ldi     r0, $00F0
        sub     r0
        jmp z, .unpress         ; Сканкод = 0xF0 -> отметка "Отжата"
        add     r0              ; Вернуть значение ACC
        ldi     r0, .kbtable
        add     r0
        sta     r0
        lda     [r0]            ; ACC = kbtable[ACC]
        clh
        sta     r0
        lda     [.kbpress]
        ora     r0
        sta     r0              ; r0 = ACC | [.kbpress]
        lda     $0000
        sta     [.kbpress]      ; Очистить .kbpress
        lda     r0
        ret

.unpress: ; Закрепить за следующей клавишей, что она отжата

        lda     $FF00
        sta     [.kbpress]
        lda     $0000
        ret

.kbpress: dw 0
.kbtable:

;        0    1    2    3    4    5    6    7    8    9    A    B    C    D    E    F
db       0 , ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '~', ' ' ; 0x
db      ' ', ' ', ' ', ' ', ' ', 'Q', '1', ' ', ' ', ' ', 'Z', 'S', 'A', 'W', '2', ' ' ; 1x
db      ' ', 'C', 'X', 'D', 'E', '4', '3', ' ', ' ', ' ', 'V', 'F', 'T', 'R', '5', ' ' ; 2x
db      ' ', 'N', 'B', 'H', 'G', 'Y', '6', ' ', ' ', ' ', 'M', 'J', 'U', '7', '8', ' ' ; 3x
db      ' ', ',', 'K', 'I', 'O', '0', '9', ' ', ' ', '.', '/', 'L', ';', 'P', '-', ' ' ; 4x
db      ' ', ' ',0x27, ' ', '[', '=', ' ', ' ', ' ', ' ', ' ', ']', ' ',0x5C, ' ', ' ' ; 5x
db      ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ' ; 6x
db      ' ', ' ', ' ', ' ', ' ', ' ',0x01, ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ' ; 7x

; ----------------------------------------------------------------------

cls:    ; Очистка экрана
        ldi     r0, 0
        ldi     r1, $f000
        ldi     r2, 2000
@@:     lda     $1700
        sta     [r1]
        inc     r1
        swap
        sta     [r1]
        inc     r1
        dec     r2
        bra nz, @b

        ; Пропись текста
        ldi     r1, $f000 + 2*(80 + 2)
        ldi     r2, mesg
        call    print

;; -------------------------------
        ldi     r1, $F000
        ldi     r3, $00FF
@@:     lda     [$FFA3]         ; Mouse Counter
        and     r3
        xor     r2
        bra z,  @b
        lda     [$FFA2]         ; Mouse Data
        sta     [r1]
        inc     r1
        inc     r1
        lda     [$FFA3]
        and     r3
        sta     r2
        bra     @b
;; -------------------------------

        ; Отслеживание нажатия клавиши десу падла
        ldi     r1, $FFA2       ; FFA0
        ldi     r2, $FFA3       ; FFA1
        ldi     r3, 0           ; been
        ldi     r4, $F000
@@:     lda     [r2]
        xor     r3              ; Проверка изменений
        bra z,  @b
        mov     r3, [r2]
        mov     [r4], [r1]
        inc     r4
        inc     r4
        bra     @b

        include "print.asm"

mesg    db "Я всегда хотел сделать календарь и программу учета спичек...",0
