; Параметры
d1m1:   defb    0, 0, 0,   0, 0, 0    ; Делимое
d1m2:   defb    0, 0, 0               ; Делитель или число
d1m3:   defb    0, 0, 0               ; Результат

; ----------------------------------------------------------------------
; Деление 24 битных чисел
; ----------------------------------------------------------------------

div24:
        ; Очистить результат d1m3
        ld      hl, d1m3
        xor     a
        ld      (hl), a
        inc     hl
        ld      (hl), a
        inc     hl
        ld      (hl), a

        ; Вычисление 24 битов
        ld      b, 24
p5m5:   push    bc
        ld      b, 6                ; Сдвиг делимого на 1 влево
        ld      hl, d1m1
        call    mul2
        ld      b, 3                ; Сдвинуть результат
        ld      hl, d1m3
        call    mul2
        inc     (hl)
        ld      b, 3                ; Рассчитать разность
        ld      de, d1m1+3
        ld      hl, d1m2
        call    subtr
        jr      nc, p5m4            ; Оставить бит
        ld      b, 3
        call    addst               ; Вернуть назад
        ld      hl, d1m3
        dec     (hl)                ; Обнулить бит
p5m4:   pop     bc
        djnz    p5m5
        ret

; ----------------------------------------------------------------------
; Умножить число (HL) на 2, B=кол-во байт
; ----------------------------------------------------------------------

mul2:   xor     a               ; CF=0
        push    hl
p5m1:   ld      a, (hl)
        rla
        ld      (hl), a
        inc     hl
        djnz    p5m1
        pop     hl
        ret

; ----------------------------------------------------------------------
; Вычесть число (DE) - (HL) => (DE), B=кол-во байт
; Сложить число (DE) + (HL) => (DE), B=кол-во байт
; Carry Flag имеет значение на выходе
; ----------------------------------------------------------------------

; ВЫЧЕСТЬ
subtr:  xor     a
        push    de
        push    hl
p5m2:   ld      a, (de)
        sbc     a, (hl)
        ld      (de), a
        inc     hl
        inc     de
        djnz    p5m2
        jr      p5m6            ; Экономия 1 байта o_O

; СЛОЖИТЬ
addst:  xor     a
        push    de
        push    hl
p5m3:   ld      a, (de)
        adc     a, (hl)
        ld      (de), a
        inc     hl
        inc     de
        djnz    p5m3
p5m6:   pop     hl
        pop     de
        ret

; ----------------------------------------------------------------------
; Сделать число (HL) отрицательным, B=3 кол-во байт
; ----------------------------------------------------------------------

negate: ld      c, 1       ; C=1 перенос
p4m1:   ld      a, (hl)
        cpl
        add     c
        ld      (hl), a
        inc     hl
        ld      c, 0
        jr      nc, $+3
        inc     c
        djnz    p4m1
        ret
