; ----------------------------------------------------------------------
; Процедура очистки экрана, в регистре C атрибут
; ----------------------------------------------------------------------

CLS:    ld      hl, $4000
        ld      b, $00
L1:     ld      (hl), b
        inc     l
        jr      nz, L1
        inc     h
        ld      a, h
        cp      $5B
        ret     z
        cp      $58
        jr      nz, L1
        ld      b, c
        jr      L1

; ----------------------------------------------------------------------
; Вычисление адреса DE для шрифта по A [A, DE]
; ----------------------------------------------------------------------
CPAD:   push    hl
        sub     a, $20
        ld      h, 0
        ld      l, a
        ld      de, fonts
        add     hl, hl
        add     hl, hl
        add     hl, hl
        add     hl, de
        ex      de, hl
        pop     hl
        ret
