hello:      defb    "TinyBasi",127,"1.0",13,0
buffer:     defw    0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0

; ----------------------------------------------------------------------
; Старт операционной системы
; ----------------------------------------------------------------------

start:      xor     a
            out     ($FE), a
            ld      a, $07
            apic    api_cls

            ld      de, hello
            apic    api_print

ml:         rst     $18
            rst     $08
            jr      ml

