; ----------------------------------------------------------------------
; Деление r1 на r2 => r1, остаток r3
; ----------------------------------------------------------------------

divmod:

        push    r0 r4
        ldi     r0, 16  ; Количество итерации
        ldi     r3, 0   ; Остаток
        ldi     r4, 0   ; Результат
.L1:    shl     r4      ; Подготовка бита
        shl     r3      ; Сдвиг r3:r1 влево
        shl     r1
        bra nc, @f      ; Есть перенос?
        inc     r3
@@:     lda     r3
        sub     r2      ; Вычитаем
        bra nc, @f      ; Проверим, что r3 < r2
        add     r2      ; Вернуть обратно
        inc     r4      ; Нет переноса
@@:     sta     r3
        dec     r0
        bra nz, .L1
        xor     r4, $FFFF
        mov     r1, r4
        pop     r4 r0
        ret
