; ======================================================================
; Очистка экрана в цвет ACC
; ======================================================================
cls:    sta     r0
        ldi     r1, $f000
        ldi     r2, 2000
@@:     lda     r0
        sta     [r1]
        inc     r1
        swap
        sta     [r1]
        inc     r1
        dec     r2
        bra nz, @b
        ret

; ======================================================================
; Печать строки (r0) на экране (r1)
; ======================================================================
print:  push    r3 r4 r5
        ldi     r3, $00ff
.L1:    lda     [r0]
        inc     r0
        and     r3
.L2:    bra z,  .L4xit
; ----------------------------------------------------------------------
; Преобразование UTF8 -> ASCII (r4, r5)
        sta     r5
        ldi     r4, $D0
        sub     r4
        sta     r4
        lda     r5
        bra z,  .L4d0        ; D0
        dec     r4
        bra z,  .L4d1        ; D1
        bra     .L4out
.L4d0:  lda     [r0]
        inc     r0
        and     r3
        ldi     r4, $10
        sub     r4
        bra     .L4out
.L4d1:  lda     [r0]
        inc     r0
        and     r3
        ldi     r4, $60
        add     r4
; ----------------------------------------------------------------------
.L4out: sta     [r1]
        inc     r1
        lda     $001F
        sta     [r1]
        inc     r1
        bra     .L1
.L4xit: pop     r5 r4 r3
        ret
