// Инициализация регистров общего назначения
reg [31:0] r32[8];
reg [15:0] s16[6];
reg [31:0] ip;
reg [32:0] eflags;

initial begin

    r32[0] = 32'h00_00_00_00; // EAX
    r32[1] = 32'h00_00_00_00; // ECX
    r32[2] = 32'h00_00_00_00; // EDX
    r32[3] = 32'h00_00_00_00; // EBX
    r32[4] = 32'h00_00_00_00; // ESP
    r32[5] = 32'h00_00_00_00; // EBP
    r32[6] = 32'h00_00_00_00; // ESI
    r32[7] = 32'h00_00_00_00; // EDI

    s16[0] = 16'h0000; // ES
    s16[1] = 16'h0000; // CS
    s16[2] = 16'h0000; // SS
    s16[3] = 16'h0000; // DS
    s16[4] = 16'h0000; // FS
    s16[5] = 16'h0000; // GS

    ip     = 32'h0000_0000;

    //                       IV V     NIO
    //                       DP FAVR 0TPL ODIT SZ0A 0P1C
    eflags = 32'b0000_0000_0010_0000_0000_0000_0000_0010;

end
