parameter
    alu_ora = 3'b000,
    alu_and = 3'b001,
    alu_eor = 3'b010,
    alu_adc = 3'b011,
    alu_sta = 3'b100,
    alu_lda = 3'b101,
    alu_cmp = 3'b110,
    alu_sbc = 3'b111;

parameter
    flag_carry = 0;

// ---------------------------------------------------------------------
// Регистры
// ---------------------------------------------------------------------

reg [ 7:0] A  = 8'h00;      // Аккумулятор
reg [ 7:0] X  = 8'h00;      // Индексный X
reg [ 7:0] Y  = 8'h00;      // Индексный Y
reg [ 7:0] S  = 8'h00;      // Стек
reg [ 7:0] P  = 8'h00;      // Флаги
reg [15:0] PC = 16'h0000;   // Регистр счетчика команд

// ---------------------------------------------------------------------
// Состояние процессора
// ---------------------------------------------------------------------

reg [ 2:0] alu      = 3'h0;
reg [ 8:0] alu_res  = 8'h0;
reg [ 7:0] alu_flag = 8'h0;
reg [ 7:0] src      = 8'h0;
